export const educationTypes = {
  labels: [
    "Сельскохозяйственная школа",
    "Архитектура и планирование",
    "Искусство и дизайн",
    "Торговля и управление",
    "Образование",
    "Техника и технологии",
    "География и геология",
    "Литература и культура",
    "Языки и филология",
    "Право",
    "Математика и ИТ",
    "Медицинские науки",
    "Естественные науки",
    "Социальные науки",
    "Коммуникация и информация",
  ],
  data: [85, 99, 97, 97, 92, 102, 92, 93, 97, 94, 103, 99, 102, 98, 94],
};

export const educationLevels = {
  labels: [
    "Без диплома",
    "Диплом средней школы",
    "2 года высшего образования",
    "3 года высшего образования",
    "4 года высшего образования",
    "5 лет высшего образования",
    "Больше 5 лет высшего образования",
  ],
  data: [90, 94, 97, 99, 100, 101, 99],
};

export const genderTypes = {
  labels: ['Мужчина', 'Женщина'],
  data: [99, 96],
}

